[{"Brand":"Mongoose","PId":"BKMG16MTYAX29","ProductName":"Mens TYAX Hardtail","GraphicName":"TYAX_Hardtail.jpg","MSRP":"589.99","CostPrice":"569.99","QtyOnHand":"5","QtyOnBackOrder":"10","Description":"The Tyax is even more fun as a 29er. You can roll over anything! Cross country mountain biking doesn''t need to be complicated. The Mongoose Tyax understands your riding needs; it''s here to deliver a smooth ride that''s sturdy but still has a hearty helping of agility."},
{"Brand":"Mongoose","PId":"BKMG16MTYAX26","ProductName":"Mens Hardtail TYAX_SUPA","GraphicName":"TYAX_SUPA_SPORT.jpg","MSRP":"679.99","CostPrice":"669.99","QtyOnHand":"5","QtyOnBackOrder":"30","Description":"Cross country mountain biking doesn''t need to be complicated. The Mongoose TYAX SUPA understands your riding needs; it''s here to deliver a smooth ride that''s sturdy but still has a hearty helping of agility. Extra tire clearance from plus-sized tires means better traction on steep climbs and gnarly descents. Ride faster, hug corners tighter and ride new trails with that added boost of confidence."},
{"Brand":"Mongoose","PId":"BKMG16MKORE29","ProductName":"Mens Reform Sport 700c ","GraphicName":"Reform_Sport_700c.jpg","MSRP":"599.99","CostPrice":"549.99","QtyOnHand":"8","QtyOnBackOrder":"10","Description":"This Mongoose Reform bike has wider tires than your typical commuter, perfect for rides with rougher roads or gravel paths. Light trails, rocky paths and long pavement rides are all in play on the Reform. Speedy like a road bike, with the durability of a mountain bike, and as comfortable as a cruiser, hybrid bikes are built for everyday riding."},
{"Brand":"Mongoose","PId":"BKMG16GRKD11","ProductName":"Girls Rockadile","GraphicName":"Rockadile_Bike_G11.jpg","MSRP":"269.99","CostPrice":"249.99","QtyOnHand":"2","QtyOnBackOrder":"5","Description":"This Mongoose Rockadile bike is perfect for young mountain bikers getting into the sport, featuring a sturdy Mongoose youth MTB aluminum hard tail frame with a Mongoose suspension fork to soak up bumps on the trail. The Shimano Tourney 7-speed drivetrain comes with premium Tourney Ez-fire shifters for smooth shifting when climbing those pesky hills."},
{"Brand":"Mongoose","PId":"BKMG16BRKD13","ProductName":"Boys Rockadile","GraphicName":"Rockadile_Bike_B13.jpg","MSRP":"269.99","CostPrice":"249.99","QtyOnHand":"5","QtyOnBackOrder":"10","Description":"This Mongoose Rockadile is perfect for young mountain bikers getting into the sport, featuring a sturdy Mongoose youth MTB aluminum hard tail frame with a Mongoose suspension fork to soak up bumps on the trail. The Shimano Tourney 21-speed drivetrain comes with premium Tourney ez-fire Shifters for smooth shifting when climbing those pesky hills."},
{"Brand":"Mongoose","PId":"BKMG16BRKD11","ProductName":"Boys Rockadile","GraphicName":"Rockadile_Bike_B11.jpg","MSRP":"569.99","CostPrice":"249.99","QtyOnHand":"2","QtyOnBackOrder":"5","Description":"This Mongoose Rockadile is perfect for young mountain bikers getting into the sport, featuring a sturdy Mongoose youth MTB aluminum hard tail frame with a Mongoose suspension fork to soak up bumps on the trail. The Shimano Tourney 21-speed drivetrain comes with premium Tourney ez-fire Shifters for smooth shifting when climbing those pesky hills."},
{"Brand":"Kona","PId":"BKKO16BRKD13","ProductName":"Mens Dr Dew","GraphicName":"Dr_Dew.jpg","MSRP":"1199.00","CostPrice":"1099.00","QtyOnHand":"3","QtyOnBackOrder":"5","Description":"Clean, simple, stylish and dependable: we pull out all the stops on the Dr Dew. Its 1x drivetrain is the first thing to catch your eye—the simple wide range of gears is perfect for flat cruises but also makes quick work of fast hill sprints. The sensible fenders, hydraulic disc brakes and plush Clement 40c tires showcase our attention to urban environments. Designed to turn heads, the Dr. Dew is built to last like only a Kona can."},
{"Brand":"Kona","PId":"BKKO17MRDR18","ProductName":"Mens Sutra LTD","GraphicName":"Sutra_LTD.jpg","MSRP":"2499.00","CostPrice":"2259.00","QtyOnHand":"5","QtyOnBackOrder":"5","Description":"The road ahead may be paved with good intentions, but where it ends and the real adventure begins is when the Sutra LTD is at its best. The steel frame begs for long days on roads no longer found on a map, and the hydraulic brakes and 1x drivetrain provide all-around capability when those roads become trails and the thrill of exploration takes over."},
{"Brand":"Kona","PId":"BKKO17MDEW18","ProductName":"Unisex Dew","GraphicName":"Dew.jpg","MSRP":"599.00","CostPrice":"599.00","QtyOnHand":"7","QtyOnBackOrder":"20","Description":"Built to withstand a lifetime of miles and evoke a smile every time you ride. Relaxed and confidence-inspiring, the Dew is designed with comfort in mind. We spec’d it smartly to ensure it makes quick work of commutes and leisurely Sunday rides on the local bike path."},
{"Brand":"Kona","PId":"BKKO17UBOT18","ProductName":"Unisex UTE","GraphicName":"UTE.jpg","MSRP":"1799.00","CostPrice":"1650.00","QtyOnHand":"3","QtyOnBackOrder":"10","Description":"Multiple Bike-of-the-Year awards speak for themselves. The Ute is a well-designed, carry-everything utility bike that makes quick work of trips to the store, dropping the kids off at school and bringing the tree home for the holidays. We didn’t need any awards to tell us how rad this bike is, but it’s nice to see that other people get it."},
{"Brand":"Kent","PId":"BKKN16LRCK165","ProductName":"Ladies Rock Mountain","GraphicName":"Rock_Mountain.jpg","MSRP":"229.99","CostPrice":"249.99","QtyOnHand":"2","QtyOnBackOrder":"5","Description":"The 21-speed Rock Mountain dual suspension mountain bike is ready to tackle any trail.  Built around a hand-crafted steel frame and a suspension fork, this bicycle is designed to handle big hits and come back for more.  Alloy rims and a Shimano rear derailleur round out this powerful package."},
{"Brand":"Kent","PId":"BKKN16LTRA26","ProductName":"Ladies Terra Mountain","GraphicName":"Terra_Mountain_L.jpg","MSRP":"299.99","CostPrice":"279.99","QtyOnHand":"3","QtyOnBackOrder":"5","Description":"The Terra mountain bike is ready to tackle any trail any time.  It starts with a hand crafted full suspension aluminium frame that’s built strong yet light enough for great handling and all day epic rides.  A simple and reliable single pivot design keeps trips to the bike shop at a minimum."},
{"Brand":"Kent","PId":"BKKN16MLAK185","ProductName":"Mens Lakewood Cruiser","GraphicName":"Lakewood_Cruiser.jpg","MSRP":"269.99","CostPrice":"249.99","QtyOnHand":"5","QtyOnBackOrder":"5","Description":"This comfortable riding cruiser bike has a very soft wide saddle to ensure comfort. With a front basket and a rear rack, this bike is great for carrying your laptop, groceries, small errands or just to go for a quite sightseeing cruise."},
{"Brand":"Kent","PId":"BKKN16MSAF185","ProductName":"Mens Safari","GraphicName":"Safari.jpg","MSRP":"229.99","CostPrice":"219.99","QtyOnHand":"7","QtyOnBackOrder":"20","Description":"This dual suspension comfort bike is the perfect bike for anyone looking for reliability comfort and tremendous value in a city bicycle.  The heart of the Safari is a hand crafted; lightweight aluminum frame which soaks up bumps on the most uneven roads."},
{"Brand":"Kent","PId":"BKKN16MTRA26","ProductName":"Mens Terra Mountain","GraphicName":"Terra_Mountain_M.jpg","MSRP":"299.99","CostPrice":"279.99","QtyOnHand":"3","QtyOnBackOrder":"10","Description":"The Terra mountain bike is ready to tackle any trail any time.  It starts with a hand crafted full suspension aluminium frame that’s built strong yet light enough for great handling and all day epic rides.  A simple and reliable single pivot design keeps trips to the bike shop at a minimum."},
{"Brand":"Iron Horse","PId":"BKIH16MDESP29","ProductName":"Mens Desperado","GraphicName":"Desperado.jpg","MSRP":"379.99","CostPrice":"249.99","QtyOnHand":"3","QtyOnBackOrder":"10","Description":"The Ironhorse Desperado is a classic aluminum hardtail mountain bike with a front suspension fork. It is really fun to ride on rougher terrain or just on some back pavement on the way to work. The Desperado features large 29-in. wheels that will make you feel like you can roll over anything. There are 21 speeds with a Shimano EF51 EZ-Fire shifter and rear derailleur for lots of gear options and great smooth shifting."},
{"Brand":"Iron Horse","PId":"BKIH16MRDR18","ProductName":"Mens Raider 700c Hybrid","GraphicName":"Raider_700c_Hybrid.jpg","MSRP":"379.99","CostPrice":"219.99","QtyOnHand":"7","QtyOnBackOrder":"15","Description":"If you like the styling of a mountain bike but in reality you will be riding more for commuting and everyday fitness, then look at a hybrid or multi-use bike as a solution. The mechanical disc brakes let you stop smoothly in damp or dusty conditions and the alloy crank and rims, typically seen on mountain bikes keep the bike lightweight and fun to ride."},
{"Brand":"Iron Horse","PId":"BKIH16MTEMP18","ProductName":"Mens Tempo 700c","GraphicName":"Tempo_700c.jpg","MSRP":"269.99","CostPrice":"279.99","QtyOnHand":"3","QtyOnBackOrder":"5","Description":"This IronHorse men’s Tempo is the perfect bike for riders who crave a little versatility – you''ll be comfortable during your commute, riding for fitness, or just out for a ride with the family. The Tempo features an upright riding position with sweptback handlebars, spring seat, and a steel hybrid frame with a front suspension fork and suspension seat post for added comfort."},
{"Brand":"Infinity","PId":"BKIF16MHT26","ProductName":"Unisex Backroads CRAZYHORSE","GraphicName":"CRAZYHORSE_HT26.jpg","MSRP":"299.99","CostPrice":"269.99","QtyOnHand":"4","QtyOnBackOrder":"5","Description":"The Infinity Crazyhorse HT26 Backroads 8 unisex MTB with an aluminum frame is all-purpose and versatile for all of your on and off road adventures.  It has Shimano 21-speed Shimano EF-41 Easyfire trigger shifters and Shimano 7-speed rear derailleur with Shimano 3-speed front derailleur alloy V-brakes and alloy rims. Front suspension provides a smoother riding on the trails."},
{"Brand":"Infinity","PId":"BKIF16UBOT18","ProductName":"Unisex Boss Two","GraphicName":"Boss_two.jpg","MSRP":"279.99","CostPrice":"259.99","QtyOnHand":"3","QtyOnBackOrder":"5","Description":"The Infinity Boss.two unisex hybrid bike has an aluminium 6061 frame with rigid straight blade front fork.  Comfort and performance are built into each frame, offering around-town riding opportunities."}]